# Forest Fires in Brazil(EDA)

In [20]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [21]:
df = pd.read_csv('amazon.csv' , encoding='ISO-8859-1' )

# 1. Display Top 5 Rows of The Dataset

In [24]:
df.head()

   year state    month  number        date
0  1998  Acre  Janeiro     0.0  1998-01-01
1  1999  Acre  Janeiro     0.0  1999-01-01
2  2000  Acre  Janeiro     0.0  2000-01-01
3  2001  Acre  Janeiro     0.0  2001-01-01
4  2002  Acre  Janeiro     0.0  2002-01-01

# 2. Check Last 5 Rows

In [25]:
df.tail()

      year      state     month  number        date
6449  2012  Tocantins  Dezembro   128.0  2012-01-01
6450  2013  Tocantins  Dezembro    85.0  2013-01-01
6451  2014  Tocantins  Dezembro   223.0  2014-01-01
6452  2015  Tocantins  Dezembro   373.0  2015-01-01
6453  2016  Tocantins  Dezembro   119.0  2016-01-01

# 3. Find Shape of Our Dataset (Number of Rows And Number of Columns)

In [26]:
df.shape

(6454, 5)

In [27]:
print("number of rows are :",df.shape[0])
print("number of columns are :" , df.shape[1])

number of rows are : 6454
number of columns are : 5

# 4. Getting Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6454 entries, 0 to 6453
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    6454 non-null   int64
 1   state   6454 non-null   object
 2   month   6454 non-null   object
 3   number  6454 non-null   float64
 4   date    6454 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 252.2+ KB

#  5. Check For Duplicate Data and Drop Them

In [29]:
df.duplicated().any()

np.True_

In [34]:
df1=df.drop_duplicates()

In [35]:
df1.duplicated().any()

np.False_

# 6. Check Null Values In The Dataset

In [37]:
df.isnull().values.any()

np.False_

In [38]:
df.isnull().sum()

year      0
state     0
month     0
number    0
date      0
dtype: int64

In [43]:
df['month'].unique()

array(['Janeiro', 'Fevereiro', 'Mar√ßo', 'Abril', 'Maio', 'Junho', 'Julho',
       'Agosto', 'Setembro', 'Outubro', 'Novembro', 'Dezembro'],
      dtype=object)